web/loket/app/Controllers/UserCrud.php

    public function list(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function store() {
        $userModel = new UserModel();
        $data = [
            'nama' => $this->request->getVar('nama'),
            'alamat'  => $this->request->getVar('alamat'),
            'keluhan'  => $this->request->getVar('keluhan'),
        ];
        $userModel->insert($data);
---
INSERT INTO `users` (`nama`, `alamat`, `keluhan`) VALUES ('handono', 'mekarmukti', 'mencret')

    public function singleUser($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1

    public function delete($id = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);
---
DELETE FROM `users`
WHERE `id` = '4'
AND `id` IN ('4')